bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth/main.c
	/* Setup PRS (Peripheral Reflex System) between Timer and ADC */
	CMU_ClockEnable(cmuClock_PRS, true);
	CMU_ClockEnable(cmuClock_TIMER2, true);
	/* Connect PRS channel 0 to TIMER overflow */
	PRS_SourceSignalSet(0, PRS_CH_CTRL_SOURCESEL_TIMER2, PRS_CH_CTRL_SIGSEL_TIMER2OF, prsEdgeOff);
	/* Enable TIMER with default settings */
	TIMER_Init_TypeDef timerInit = TIMER_INIT_DEFAULT;
	timerInit.enable = false;
	TIMER_Init(TIMER2, &timerInit);
	/* Configure TIMER to trigger on sampling rate */
	TIMER_TopSet(TIMER2,  CMU_ClockFreqGet(cmuClock_TIMER2) / 20480 - 1);
	/* Enable Timer on ADC */
	TIMER_Enable(TIMER2, true);
	/* Start ADC sample */
	ADC_Start(ADC0, adcStartSingle);
	TerminateTask();
}
#define APP_Task_start_dma_STOP_SEC_CODE
#include "tpl_memmap.h"


#define APP_Task_copyDMAtoSRAM_START_SEC_CODE
#include "tpl_memmap.h"

// P2VAR(int16_t, AUTOMATIC, OS_VAR) buffer_sram;
// VAR(float, AUTOMATIC) buffer_float_sound [1024] = {0.0f};

VAR(uint8_t,AUTOMATIC) count_env = 0;
/* EBI region 0 */
#define SRAM_EXT_START_ADDR 0x80000000

#define SRAM_EXT_START_ADDR_1 0x80000000
#define SRAM_EXT_START_ADDR_2 0x80000000
#define SRAM_EXT_START_ADDR_3 0x80000000
#define SRAM_EXT_START_ADDR_4 0x80000000
#define SRAM_EXT_START_ADDR_5 0x80000000
#define SRAM_EXT_START_ADDR_6 0x80000000
#define SRAM_EXT_START_ADDR_7 0x80000000
#define SRAM_EXT_START_ADDR_8 0x80000000
#define SRAM_EXT_START_ADDR_9 0x80000000
#define SRAM_EXT_START_ADDR_10 0x80000000
#define SRAM_EXT_START_ADDR_11 0x80000000
#define SRAM_EXT_START_ADDR_12 0x80000000
#define SRAM_EXT_START_ADDR_13 0x80000000
#define SRAM_EXT_START_ADDR_14 0x80000000
#define SRAM_EXT_START_ADDR_15 0x80000000
#define SRAM_EXT_START_ADDR_16 0x80000000
#define SRAM_EXT_START_ADDR_17 0x80000000
#define SRAM_EXT_START_ADDR_18 0x80000000
#define SRAM_EXT_START_ADDR_19 0x80000000
#define SRAM_EXT_START_ADDR_20 0x80000000

/* We have 2 buffer of 1024 int16 in SRAM EXT --> START AT + 0x800 */
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR 	0x80001000
/* + 1024 FLOAT --> + 4*1024 BYTES */
#define SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR 	0x80002000
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS 0x80003000

#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR 	0x80004000
#define SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR 	0x80005000
#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS 0x80006000

#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR 	0x80007000
#define SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR 	0x80008000
#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS 0x80009000

int16_t *buffer_sram;
float32_t *prev_ping_buffer_filtered_band1;
float32_t *prev_pong_buffer_filtered_band1;
float32_t *prev_ping_buffer_filtered_band1_bis;

float32_t *prev_ping_buffer_filtered_band2;
float32_t *prev_pong_buffer_filtered_band2;
float32_t *prev_ping_buffer_filtered_band2_bis;

float32_t *prev_ping_buffer_filtered_band3;
float32_t *prev_pong_buffer_filtered_band3;
float32_t *prev_ping_buffer_filtered_band3_bis;

/* Number of 2nd order stage in filter, order is 2*numStagesIIR */
const uint32_t numStagesIIR = 3;
static float32_t firStateF32_band1 [2*3] = {0};
static float32_t firStateF32_band2 [2*3] = {0};
static float32_t firStateF32_band3 [2*3] = {0};


P2VAR(int16_t, AUTOMATIC, OS_APPL_DATA) buffer_ptr_sram[20] = {
	(int16_t *) SRAM_EXT_START_ADDR_1,
	(int16_t *) SRAM_EXT_START_ADDR_2,
	(int16_t *) SRAM_EXT_START_ADDR_3,
	(int16_t *) SRAM_EXT_START_ADDR_4,
	(int16_t *) SRAM_EXT_START_ADDR_5,
	(int16_t *) SRAM_EXT_START_ADDR_6,
	(int16_t *) SRAM_EXT_START_ADDR_7,
	(int16_t *) SRAM_EXT_START_ADDR_8,
	(int16_t *) SRAM_EXT_START_ADDR_9,
	(int16_t *) SRAM_EXT_START_ADDR_10,
	(int16_t *) SRAM_EXT_START_ADDR_11,
	(int16_t *) SRAM_EXT_START_ADDR_12,
	(int16_t *) SRAM_EXT_START_ADDR_13,
	(int16_t *) SRAM_EXT_START_ADDR_14,
	(int16_t *) SRAM_EXT_START_ADDR_15,
	(int16_t *) SRAM_EXT_START_ADDR_16,
	(int16_t *) SRAM_EXT_START_ADDR_17,
	(int16_t *) SRAM_EXT_START_ADDR_18,
	(int16_t *) SRAM_EXT_START_ADDR_19,
	(int16_t *) SRAM_EXT_START_ADDR_20
};

TASK(copyDMAtoSRAM){
	GPIO->P[gpioPortA].DOUT ^= 1<<7;
	/* Wait for event to transfer audio to sram */
	EventMaskType ev;
	WaitEvent(ev_DMAtoSRAM);
	GetEvent(copyDMAtoSRAM, &ev);
	ClearEvent(ev);
	GPIO->P[gpioPortB].DOUT |= 1<<10;
	/* We have 20 buffer of sound ie --> 1s of sound */
	static count_ptr_buffer = 0;

	int16_t *buffer_dma;
	if(isPrimaryDMABuffer){
		buffer_dma = secondaryBuffer;
	}
	else{
		buffer_dma = primaryBuffer;
	}

	buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	for(uint16_t i = 0; i < 1024; i++){
		// *buffer_sram++ = *buffer_dma++;
		*buffer_ptr_sram[count_ptr_buffer]++ = *buffer_dma++;
		// buffer_float_sound[i] = *buffer_sram++;
	}
	count_ptr_buffer++;
	if(count_ptr_buffer == 20) count_ptr_buffer = 0;
	// buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	// float32_t *input_float_test = data_input;
	// static float32_t filtered_rms_band1 [1024];
	arm_biquad_cascade_df2T_instance_f32 instFilter1;
	arm_biquad_cascade_df2T_instance_f32 instFilter2;
	arm_biquad_cascade_df2T_instance_f32 instFilter3;

	arm_biquad_cascade_df2T_init_f32(&instFilter1, numStagesIIR, &firCoefF32_band1[0], &firStateF32_band1[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter2, numStagesIIR, &firCoefF32_band2[0], &firStateF32_band2[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter3, numStagesIIR, &firCoefF32_band3[0], &firStateF32_band3[0]);

	prev_ping_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR;
	prev_pong_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR;
	prev_ping_buffer_filtered_band1_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS;

	prev_ping_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR;
	prev_pong_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR;
	prev_ping_buffer_filtered_band2_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS;

	prev_ping_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR;
	prev_pong_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR;
	prev_ping_buffer_filtered_band3_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS;

	float32_t result_rms;
	float32_t *ptr_result_rms = &result_rms;
	
	if(isPrimaryDMABuffer){
		// arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sound, prev_pong_buffer_filtered_band1, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sound, prev_pong_buffer_filtered_band2, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sound, prev_pong_buffer_filtered_band3, 1024);

		arm_biquad_cascade_df2T_f32(&instFilter1, buffer_ptr_sram[0], prev_pong_buffer_filtered_band1, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter2, buffer_ptr_sram[0], prev_pong_buffer_filtered_band2, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter3, buffer_ptr_sram[0], prev_pong_buffer_filtered_band3, 1024);

		GPIO->P[gpioPortB].DOUT |= 1<<9;

		for(uint8_t i = 0; i < 8; i++){
			
			/* RMS on previous and current buffer with hop length of 128 */
			arm_rms_f32(prev_ping_buffer_filtered_band1+(128*i), 1024, ptr_result_rms);
			envelope_1[count_env] = result_rms;
			arm_rms_f32(prev_ping_buffer_filtered_band2+(128*i), 1024, ptr_result_rms);
			envelope_2[count_env] = result_rms;
			arm_rms_f32(prev_ping_buffer_filtered_band3+(128*i), 1024, ptr_result_rms);
			envelope_3[count_env] = result_rms;
			count_env++;
			if(count_env >= 80) {
				GPIO->P[gpioPortA].DOUT ^= 1<<8;
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}		
		}
		GPIO->P[gpioPortB].DOUT &= ~(1<<9);

