bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth/main.c
	}
	else{
		// arm_biquad_cascade_df2T_f32(&instFilter1, buffer_float_sound, prev_ping_buffer_filtered_band1, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter2, buffer_float_sound, prev_ping_buffer_filtered_band2, 1024);
		// arm_biquad_cascade_df2T_f32(&instFilter3, buffer_float_sound, prev_ping_buffer_filtered_band3, 1024);

		arm_biquad_cascade_df2T_f32(&instFilter1, buffer_ptr_sram[0], prev_ping_buffer_filtered_band1, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter2, buffer_ptr_sram[0], prev_ping_buffer_filtered_band2, 1024);
		arm_biquad_cascade_df2T_f32(&instFilter3, buffer_ptr_sram[0], prev_ping_buffer_filtered_band3, 1024);

		for(uint16_t i = 0; i < 1024; i++){
			*prev_ping_buffer_filtered_band1_bis++ = *prev_ping_buffer_filtered_band1++;
			*prev_ping_buffer_filtered_band2_bis++ = *prev_ping_buffer_filtered_band2++;
			*prev_ping_buffer_filtered_band3_bis++ = *prev_ping_buffer_filtered_band3++;
		}
		GPIO->P[gpioPortB].DOUT |= 1<<9;
		for(uint8_t i = 0; i < 8; i++){
			/* RMS on previous and current buffer with hop length of 128 */
			arm_rms_f32(prev_pong_buffer_filtered_band1+(128*i), 1024, ptr_result_rms);
			envelope_1[count_env] = result_rms;
			arm_rms_f32(prev_pong_buffer_filtered_band2+(128*i), 1024, ptr_result_rms);
			envelope_2[count_env] = result_rms;
			arm_rms_f32(prev_pong_buffer_filtered_band3+(128*i), 1024, ptr_result_rms);
			envelope_3[count_env] = result_rms;
			count_env++;
			if(count_env >= 80) {
				count_env = 0;
				SetEvent(inference, ev_NORMALIZE);
			}
		}
		GPIO->P[gpioPortB].DOUT &= ~(1<<9);

	}

	/* For testing only, we write 128 sec to sd card, 8KHz --> 1024 points --> 0.128 s --> x1000 */
	/* For testing only, we write 465 sec to sd card, 22KHz --> 1024 points --> 0.0465 s --> x10000 */

	// static uint16_t cnt_write = 0;
	// if(cnt_write < 1000){
	// 	cnt_write++;
	// 	f_open(&fileaudio, "audio.wav", FA_OPEN_APPEND | FA_WRITE);
	// 	f_write(&fileaudio, check_buffer_sram, 2*1024, &bw);
	// 	f_close(&fileaudio);
	// }
	// else{
	// 	TerminateTask();
	// }

	GPIO->P[gpioPortB].DOUT &= ~(1<<10);
	ChainTask(copyDMAtoSRAM);
}
#define APP_Task_copyDMAtoSRAM_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_start_sdcard_START_SEC_CODE
#include "tpl_memmap.h"

static FATFS fatfs;

static void setTime(uint32_t time, uint32_t milliseconds) {
	/* 1024 tick per seconds */
    uint32_t ticks = ROUNDED_DIV(1024 * milliseconds, 1000);
    uint64_t intendedCounter = 1024 * (uint64_t)time + ticks;
    uint64_t offset = intendedCounter - (uint64_t)BURTC_CounterGet();
    BURTC_RetRegSet(1, (uint32_t)(offset >> 32));
    BURTC_RetRegSet(0, (uint32_t)(offset & 0xFFFFFFFF));
    BURTC_RetRegSet(2, 0x11223344);
	return;
}

static void getTime(uint32_t *time, uint32_t *milliseconds) {

    uint64_t offset =  (uint64_t)BURTC_RetRegGet(1) << 32;
    offset += (uint64_t)BURTC_RetRegGet(0);
    uint64_t currentCounter = offset + BURTC_CounterGet();

    if (time != NULL) {
        *time = currentCounter / 1024;
    }

    if (milliseconds != NULL) {
        uint32_t ticks = currentCounter % 1024;
        *milliseconds = ROUNDED_DIV(1000 * ticks, 1024);
    }
	return;
}

static void handleTimeOverflow(void) {
    uint32_t offsetHigh = BURTC_RetRegGet(1);
    BURTC_RetRegSet(1, offsetHigh + 1);
}

/* Time function for FAT file system */
DWORD get_fattime(void) {

    int8_t timezoneHours = 0;

    int8_t timezoneMinutes = 0;

    uint32_t currentTime;

    getTime(&currentTime, NULL);

    if (BURTC_IntGet() & BURTC_IF_OF) {
        handleTimeOverflow();
        getTime(&currentTime, NULL);
        BURTC_IntClear(BURTC_IF_OF);
    }

    time_t fatTime = currentTime + timezoneHours * 60 * 60 + timezoneMinutes * 60;

    struct tm timePtr;
	// return 0;
    gmtime_r(&fatTime, &timePtr);

    return (((unsigned int)timePtr.tm_year - 208) << 25) |
            (((unsigned int)timePtr.tm_mon + 1 ) << 21) |
            ((unsigned int)timePtr.tm_mday << 16) |
            ((unsigned int)timePtr.tm_hour << 11) |
            ((unsigned int)timePtr.tm_min << 5) |
            ((unsigned int)timePtr.tm_sec >> 1);
}


TASK(start_sdcard){
	GPIO_PinModeSet(gpioPortD, 12, gpioModePushPull, 1);
	/* Turn on SD card (PortD 12)*/
	GPIO_PinOutClear(gpioPortD, 12);
	/* Init */
	MICROSD_Init();
	/* Check SD card status */
	DSTATUS resCard = disk_initialize(0);
	if (resCard == STA_NOINIT || resCard == STA_NODISK || resCard == STA_PROTECT) {
        while(1);
    }
    /* Initialise file system */
    if (f_mount(&fatfs, "", 1) != FR_OK) {
        while(1);
    }
	TerminateTask();

}
#define APP_Task_start_sdcard_STOP_SEC_CODE
#include "tpl_memmap.h"

// #define APP_Task_write_audio_START_SEC_CODE
// #include "tpl_memmap.h"
// TASK(write_audio){
// 	/* We are here from inference hit */
// 	/* First Terminate copyDMAtoSRAM Task */
// 	TerminateTask(copyDMAtoSRAM);
// 	/* Variable to write */
// 	/* Create a file */
// 	const int duration_in_second = 2;				/* For example 1024/8000 = 0.128 s */
// 	const uint16_t samplerate = 20480;

// 	/* Header detail of wav file */
// 	static wavHeader_t wavHeader = {
// 	 .riff = {.id = "RIFF", .size = 0},
// 		.format = "WAVE",
// 		.fmt = {.id = "fmt ", .size = sizeof(wavFormat_t)},
// 		.wavFormat = {.format = 1,							/* PCM format */
// 					  .numberOfChannels = 1,
// 					  .samplesPerSecond = samplerate,				/* 8 KHz */
// 					  .bytesPerSecond = 2*samplerate,
// 					  .bytesPerCapture = 2,
// 					  .bitsPerSample = 16},
// 		.list = {.id = "LIST",
// 				 .size = 4 + sizeof(icmt_t) + sizeof(iart_t)},
// 		.info = "INFO",
// 		.icmt = {.icmt.id = "ICMT", .icmt.size = 0, .comment = ""},
// 		.iart = {.iart.id = "IART", .iart.size = 0, .artist = ""},
// 		.data = {.id = "data", .size = 0}
// 	};

// 	wavHeader.wavFormat.samplesPerSecond = samplerate;
// 	wavHeader.wavFormat.bytesPerSecond = 2 * samplerate;
// 	wavHeader.data.size = 2 * samplerate * duration_in_second;
// 	wavHeader.riff.size = 2 * samplerate * duration_in_second +
// 						   sizeof(wavHeader_t) - sizeof(chunk_t);

//    	f_open(&fileaudio, "audio.wav", FA_OPEN_APPEND | FA_WRITE);
// 	f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
// 	while()
// 	f_close(&fileaudio);
// }
// #define APP_Task_write_audio_STOP_SEC_CODE
// #include "tpl_memmap.h"

#define APP_ISR_isr_dma_START_SEC_CODE
#include "tpl_memmap.h"
ISR(isr_dma){
	/* Get interrupt mask */
	uint32_t interruptMask = DMA_IntGet();
	if(interruptMask == DMA_IF_CH0DONE){
		/* Clear interrupt */
		DMA_IntClear(DMA_IFC_CH0DONE);
		isPrimaryDMABuffer = !isPrimaryDMABuffer;
		/* Re-activate the DMA */
    	DMA_RefreshPingPong(0,
        	isPrimaryDMABuffer,						/* bool to change between dma descriptor, primaryBuffer or secondaryBuffer DST*/
        	false,
        	NULL,									/* dst : NULL = same as in descriptor, thus same as in start dma TASK, (void*)primaryBuffer or (void*)secondaryBuffer */
        	NULL,									/* src : NULL = same as in descriptor, thus same as in start dma TASK, (void*)&(ADC0->SINGLEDATA) */
        	numberOfSamplesPerTransfer - 1,
        	false);
		SetEvent(copyDMAtoSRAM, ev_DMAtoSRAM);
	}
	else if (interruptMask == DMA_IF_CH1DONE){
		/* nothing to do on DMA ch 1 ? */
	}
}
#define APP_ISR_isr_dma_STOP_SEC_CODE
#include "tpl_memmap.h"
